{
  "name": "Mark Spencer",
  "label": "Business Analytics Consultant",
  "image_path": "img/profile.jpg",
  "contact": {
    "email": "mrkspencer07@gmail.com",
    "phone": "319-594-1445",
    "location": "Denver, Colorado"
  },
  "summary": "Data analytics and engineering background. I have been more recently delving into web development and cloud as an overall tech enthusiast, professional, and hobbyist. I am also developing analytical acumen, exploring FRM, CMA, and CIPM certifications.",
  "base_url": "127.0.0.1:5500",
  "social_links": [
    {
      "label": "LinkedIn",
      "url": "https://www.linkedin.com/in/mrkspencer07/",
      "svg_path": "img/linkedin.svg"
    },
    {
      "label": "Github",
      "url": "https://github.com/mark-spencer-git",
      "svg_path": "img/github.svg"
    }
  ],
  "work_experience": [
    {
      "company": "MassMutual - Private Wealth & Trust",
      "position": "Business Analytics Consultant",
      "url": "https://www.massmutual.com/",
      "start_date": "March 2022",
      "end_date": "Present",
      "summary": "Hone analytical skills from engineering to end-user reporting. Challenge self by assuming larger, sole analytic responsibilities of investment organization. ",
      "highlights": [
        "Engineer analytics efforts to modernize an investment organization’s manual reporting systems to automated systems",
        "Report for a large investment organization through Python scripting, database administration, SQL, Tableau, and GitHub",
        "Investment management support of Private Wealth & Trust, largely investment and data overlapping work",
        "Project management of investment analytics for Private Wealth & Trust, coordinating with business and technical stakeholders",
        "Developed and directed personal and others’ eclectic skills for key Private Wealth & Trust deliverables"
      ]
    },
    {
      "company": "The Vanguard Group - Chief Data and Analytics Office",
      "position": "Data Analyst",
      "url": "https://investor.vanguard.com/",
      "start_date": "August 2020",
      "end_date": "March 2022",
      "summary": "Acclimate to big data, technologies, and analyst responsibilities.",
      "highlights": [
        "Query, transform, and analyze retail data, primarily utilizing AWS S3 and EMR, SQL, and Python",
        "Report to internal stakeholders on reports and data products through tabular data and visualization software (Tableau)",
        "Perform advanced technical and analytical work including advanced SQL querying, experimentation, Python automation, module/package development, production support for reports on Tableau Server, and data mining via data API services",
        "Collaborate on a Scrum team, managing numerous reports and data products",
        "Oversee 15 Tableau reports, Tableau Server, new report builds, retail data warehouse data, and new technology adoption"

      ]
    },
        {
      "company": "The Vanguard Group - Client Services and Operations",
      "position": "Operations Specialist",
      "url": "https://investor.vanguard.com/",
      "start_date": "November 2016",
      "end_date": "August 2020",
      "summary": "Develop as a financial professional, understanding their offerings, services, and products. Work towards goal of being a formal analyst by integrating analyst work.",
      "highlights": [
        "Service clerical and financial client requests, ranging in request, account type, and client segment complexity",
        "Create policies and procedures as a department Subject Matter Expert for various financial processing functions",
        "Developed data analytics tools, including macros, databases, and data visualizations, primarily in Python, SQL, and Tableau",
        "Greenlit retail operations’ Value Stream Mapping and Straight-Through Processing initiatives through analysis and reporting"
      ]
    }
  ],
  "projects": [
    {
      "title": "Postgres ELT",
      "summary": "ELT package for Excel file ELT to Postgres DB",
      "url": "https://github.com/mark-spencer-git/elt",
      "highlights": [
        "Repo framework for building a Postgres database to then build analytics"
      ],
      "images": [
        {
          "img_path": "portfolio_media/Sample Excel.jpg",
          "caption": "Sample Excel File"
        },
        {
          "img_path": "portfolio_media/DBeaver Screenshot.jpg",
          "caption": "Postgres Output"
        }
      ]
    }
  ],
  "volunteer_experience": [
    {
      "organization": "Iowa Youth Writing Program",
      "position": "Mentor",
      "url": "https://iywp.org/",
      "start_date": "August 2015",
      "end_date": "May 2016",
      "summary": "Started as a tutor for the program then continued as a volunteer mentor for the program",
      "highlights": [
        "Tutored local elementary students in writing through University of Iowa class",
        "Mentored University of Iowa students in lesson planning for elementary students in writing and grammar"
      ]
    }
  ],
  "education": [
    {
      "institution": "Amazon Web Services",
      "url": "https://aws.amazon.com/certification/certified-cloud-practitioner/",
      "degrees": [
        "AWS Certified Cloud Practitioner"
      ],
      "graduation_date": "September 2024"
    },
    {
      "institution": "The University of Iowa",
      "location": "Iowa City, IA",
      "url": "https://clas.uiowa.edu/",
      "degrees": [
        "Bachelor of Arts in Economics",
        "Certificate of Entrepreneurial Management",
        "Certificate of Writing"
      ],
      "graduation_date": "May 2016"
    }
  ],
  "skills": [
    {
      "name": "Python",
      "proficiency": 95,
      "proficiency_label": "Proficiency Level"
    },
    {
      "name": "SQL",
      "proficiency": 80,
      "proficiency_label": "Proficiency Level"
    }
  ],
  "interests": [
    {
      "name": "Recreation / Athletics",
      "summary": "I enjoy powerlifting, soccer, snowboarding, and paddle/racquet sports.",
      "images": [
        {
          "img_path": "portfolio_media/Keystone Snowboarding.jpg",
          "caption": "Snowboarding (Keystone, CO)"
        },
        {
          "img_path": "portfolio_media/Payson Paddleboard.jpg",
          "caption": "Paddleboard (Payson, AZ)"
        }
      ]
    },
    {
      "name": "Travel",
      "summary": "I have visited much of Europe and several countries in Central America. I currently have Peru and Japan planned for next!",
      "images": [
        {
          "img_path": "portfolio_media/Swiss Park Pic.JPG",
          "caption": "Interlaken, Switzerland"
        },
        {
          "img_path": "portfolio_media/Budapest Parliment Building.jpg",
          "caption": "Budapest, Hungary"
        }
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native speaker"
    },
    {
      "language": "Spanish",
      "fluency": "Basic"
    }
  ],
  "references": [
    {
      "relation": "Current Coworker",
      "reference": "The collaboration between Mark and Data Science is very smooth, as his dedication and professional knowledge is the key for this work. It's my pleasure to work with Mark!"
    },
    {
      "relation": "Current Coworker",
      "reference": "Mark has continued to deliver on a wide range of investment reporting deliverables. He has also been quick to respond to reporting requests from auditors, and has been a key element in maintaining investment resources [...]. His efforts are valuable to the Investment Team and have contributed to more efficient processes and investment oversight in 2024."
    }
  ]
}
